bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/timer_reg.h
/**
  ******************************************************************************
  * @file    timer_reg.h
  * @version V1.0
  * @date    2022-05-12
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef  __TIMER_REG_H__
#define  __TIMER_REG_H__

#include "bl702l.h"

/* 0x0 : Timer Clock Source */
#define TIMER_TCCR_OFFSET                                       (0x0)
#define TIMER_CS_2                                              TIMER_CS_2
#define TIMER_CS_2_POS                                          (0U)
#define TIMER_CS_2_LEN                                          (4U)
#define TIMER_CS_2_MSK                                          (((1U<<TIMER_CS_2_LEN)-1)<<TIMER_CS_2_POS)
#define TIMER_CS_2_UMSK                                         (~(((1U<<TIMER_CS_2_LEN)-1)<<TIMER_CS_2_POS))
#define TIMER_CS_3                                              TIMER_CS_3
#define TIMER_CS_3_POS                                          (4U)
#define TIMER_CS_3_LEN                                          (4U)
#define TIMER_CS_3_MSK                                          (((1U<<TIMER_CS_3_LEN)-1)<<TIMER_CS_3_POS)
#define TIMER_CS_3_UMSK                                         (~(((1U<<TIMER_CS_3_LEN)-1)<<TIMER_CS_3_POS))
#define TIMER_CS_WDT                                            TIMER_CS_WDT
#define TIMER_CS_WDT_POS                                        (8U)
#define TIMER_CS_WDT_LEN                                        (4U)
#define TIMER_CS_WDT_MSK                                        (((1U<<TIMER_CS_WDT_LEN)-1)<<TIMER_CS_WDT_POS)
#define TIMER_CS_WDT_UMSK                                       (~(((1U<<TIMER_CS_WDT_LEN)-1)<<TIMER_CS_WDT_POS))
#define TIMER_TMR_RSV                                           TIMER_TMR_RSV
#define TIMER_TMR_RSV_POS                                       (16U)
#define TIMER_TMR_RSV_LEN                                       (8U)
#define TIMER_TMR_RSV_MSK                                       (((1U<<TIMER_TMR_RSV_LEN)-1)<<TIMER_TMR_RSV_POS)
#define TIMER_TMR_RSV_UMSK                                      (~(((1U<<TIMER_TMR_RSV_LEN)-1)<<TIMER_TMR_RSV_POS))
#define TIMER_ID                                                TIMER_ID
#define TIMER_ID_POS                                            (24U)
#define TIMER_ID_LEN                                            (8U)
#define TIMER_ID_MSK                                            (((1U<<TIMER_ID_LEN)-1)<<TIMER_ID_POS)
#define TIMER_ID_UMSK                                           (~(((1U<<TIMER_ID_LEN)-1)<<TIMER_ID_POS))

/* 0x10 : Timer2 Match Value 0 */
#define TIMER_TMR2_0_OFFSET                                     (0x10)
#define TIMER_TMR2_0                                            TIMER_TMR2_0
#define TIMER_TMR2_0_POS                                        (0U)
#define TIMER_TMR2_0_LEN                                        (32U)
#define TIMER_TMR2_0_MSK                                        (((1U<<TIMER_TMR2_0_LEN)-1)<<TIMER_TMR2_0_POS)
#define TIMER_TMR2_0_UMSK                                       (~(((1U<<TIMER_TMR2_0_LEN)-1)<<TIMER_TMR2_0_POS))

/* 0x14 : Timer2 Match Value 1 */
#define TIMER_TMR2_1_OFFSET                                     (0x14)
#define TIMER_TMR2_1                                            TIMER_TMR2_1
#define TIMER_TMR2_1_POS                                        (0U)
#define TIMER_TMR2_1_LEN                                        (32U)
#define TIMER_TMR2_1_MSK                                        (((1U<<TIMER_TMR2_1_LEN)-1)<<TIMER_TMR2_1_POS)
#define TIMER_TMR2_1_UMSK                                       (~(((1U<<TIMER_TMR2_1_LEN)-1)<<TIMER_TMR2_1_POS))

/* 0x18 : Timer2 Match Value 2 */
#define TIMER_TMR2_2_OFFSET                                     (0x18)
#define TIMER_TMR2_2                                            TIMER_TMR2_2
#define TIMER_TMR2_2_POS                                        (0U)
#define TIMER_TMR2_2_LEN                                        (32U)
#define TIMER_TMR2_2_MSK                                        (((1U<<TIMER_TMR2_2_LEN)-1)<<TIMER_TMR2_2_POS)
#define TIMER_TMR2_2_UMSK                                       (~(((1U<<TIMER_TMR2_2_LEN)-1)<<TIMER_TMR2_2_POS))

/* 0x1C : Timer3 Match Value 0 */
#define TIMER_TMR3_0_OFFSET                                     (0x1C)
#define TIMER_TMR3_0                                            TIMER_TMR3_0
#define TIMER_TMR3_0_POS                                        (0U)
#define TIMER_TMR3_0_LEN                                        (32U)
#define TIMER_TMR3_0_MSK                                        (((1U<<TIMER_TMR3_0_LEN)-1)<<TIMER_TMR3_0_POS)
#define TIMER_TMR3_0_UMSK                                       (~(((1U<<TIMER_TMR3_0_LEN)-1)<<TIMER_TMR3_0_POS))

/* 0x20 : Timer3 Match Value 1 */
#define TIMER_TMR3_1_OFFSET                                     (0x20)
#define TIMER_TMR3_1                                            TIMER_TMR3_1
#define TIMER_TMR3_1_POS                                        (0U)
#define TIMER_TMR3_1_LEN                                        (32U)
#define TIMER_TMR3_1_MSK                                        (((1U<<TIMER_TMR3_1_LEN)-1)<<TIMER_TMR3_1_POS)
#define TIMER_TMR3_1_UMSK                                       (~(((1U<<TIMER_TMR3_1_LEN)-1)<<TIMER_TMR3_1_POS))

/* 0x24 : Timer3 Match Value 2 */
#define TIMER_TMR3_2_OFFSET                                     (0x24)
#define TIMER_TMR3_2                                            TIMER_TMR3_2
#define TIMER_TMR3_2_POS                                        (0U)
#define TIMER_TMR3_2_LEN                                        (32U)
#define TIMER_TMR3_2_MSK                                        (((1U<<TIMER_TMR3_2_LEN)-1)<<TIMER_TMR3_2_POS)
#define TIMER_TMR3_2_UMSK                                       (~(((1U<<TIMER_TMR3_2_LEN)-1)<<TIMER_TMR3_2_POS))

