bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/timer_reg.h
/* 0x2C : Timer2 Counter Value */
#define TIMER_TCR2_OFFSET                                       (0x2C)
#define TIMER_TCR2_CNT                                          TIMER_TCR2_CNT
#define TIMER_TCR2_CNT_POS                                      (0U)
#define TIMER_TCR2_CNT_LEN                                      (32U)
#define TIMER_TCR2_CNT_MSK                                      (((1U<<TIMER_TCR2_CNT_LEN)-1)<<TIMER_TCR2_CNT_POS)
#define TIMER_TCR2_CNT_UMSK                                     (~(((1U<<TIMER_TCR2_CNT_LEN)-1)<<TIMER_TCR2_CNT_POS))

/* 0x30 : Timer3 Counter Value */
#define TIMER_TCR3_OFFSET                                       (0x30)
#define TIMER_TCR3_CNT                                          TIMER_TCR3_CNT
#define TIMER_TCR3_CNT_POS                                      (0U)
#define TIMER_TCR3_CNT_LEN                                      (32U)
#define TIMER_TCR3_CNT_MSK                                      (((1U<<TIMER_TCR3_CNT_LEN)-1)<<TIMER_TCR3_CNT_POS)
#define TIMER_TCR3_CNT_UMSK                                     (~(((1U<<TIMER_TCR3_CNT_LEN)-1)<<TIMER_TCR3_CNT_POS))

/* 0x38 : Timer2 Match Status */
#define TIMER_TSR2_OFFSET                                       (0x38)
#define TIMER_TSR2_0                                            TIMER_TSR2_0
#define TIMER_TSR2_0_POS                                        (0U)
#define TIMER_TSR2_0_LEN                                        (1U)
#define TIMER_TSR2_0_MSK                                        (((1U<<TIMER_TSR2_0_LEN)-1)<<TIMER_TSR2_0_POS)
#define TIMER_TSR2_0_UMSK                                       (~(((1U<<TIMER_TSR2_0_LEN)-1)<<TIMER_TSR2_0_POS))
#define TIMER_TSR2_1                                            TIMER_TSR2_1
#define TIMER_TSR2_1_POS                                        (1U)
#define TIMER_TSR2_1_LEN                                        (1U)
#define TIMER_TSR2_1_MSK                                        (((1U<<TIMER_TSR2_1_LEN)-1)<<TIMER_TSR2_1_POS)
#define TIMER_TSR2_1_UMSK                                       (~(((1U<<TIMER_TSR2_1_LEN)-1)<<TIMER_TSR2_1_POS))
#define TIMER_TSR2_2                                            TIMER_TSR2_2
#define TIMER_TSR2_2_POS                                        (2U)
#define TIMER_TSR2_2_LEN                                        (1U)
#define TIMER_TSR2_2_MSK                                        (((1U<<TIMER_TSR2_2_LEN)-1)<<TIMER_TSR2_2_POS)
#define TIMER_TSR2_2_UMSK                                       (~(((1U<<TIMER_TSR2_2_LEN)-1)<<TIMER_TSR2_2_POS))

/* 0x3C : Timer3 Match Status */
#define TIMER_TSR3_OFFSET                                       (0x3C)
#define TIMER_TSR3_0                                            TIMER_TSR3_0
#define TIMER_TSR3_0_POS                                        (0U)
#define TIMER_TSR3_0_LEN                                        (1U)
#define TIMER_TSR3_0_MSK                                        (((1U<<TIMER_TSR3_0_LEN)-1)<<TIMER_TSR3_0_POS)
#define TIMER_TSR3_0_UMSK                                       (~(((1U<<TIMER_TSR3_0_LEN)-1)<<TIMER_TSR3_0_POS))
#define TIMER_TSR3_1                                            TIMER_TSR3_1
#define TIMER_TSR3_1_POS                                        (1U)
#define TIMER_TSR3_1_LEN                                        (1U)
#define TIMER_TSR3_1_MSK                                        (((1U<<TIMER_TSR3_1_LEN)-1)<<TIMER_TSR3_1_POS)
#define TIMER_TSR3_1_UMSK                                       (~(((1U<<TIMER_TSR3_1_LEN)-1)<<TIMER_TSR3_1_POS))
#define TIMER_TSR3_2                                            TIMER_TSR3_2
#define TIMER_TSR3_2_POS                                        (2U)
#define TIMER_TSR3_2_LEN                                        (1U)
#define TIMER_TSR3_2_MSK                                        (((1U<<TIMER_TSR3_2_LEN)-1)<<TIMER_TSR3_2_POS)
#define TIMER_TSR3_2_UMSK                                       (~(((1U<<TIMER_TSR3_2_LEN)-1)<<TIMER_TSR3_2_POS))

/* 0x44 : Timer2 Match Interrupt Enable */
#define TIMER_TIER2_OFFSET                                      (0x44)
#define TIMER_TIER2_0                                           TIMER_TIER2_0
#define TIMER_TIER2_0_POS                                       (0U)
#define TIMER_TIER2_0_LEN                                       (1U)
#define TIMER_TIER2_0_MSK                                       (((1U<<TIMER_TIER2_0_LEN)-1)<<TIMER_TIER2_0_POS)
#define TIMER_TIER2_0_UMSK                                      (~(((1U<<TIMER_TIER2_0_LEN)-1)<<TIMER_TIER2_0_POS))
#define TIMER_TIER2_1                                           TIMER_TIER2_1
#define TIMER_TIER2_1_POS                                       (1U)
#define TIMER_TIER2_1_LEN                                       (1U)
#define TIMER_TIER2_1_MSK                                       (((1U<<TIMER_TIER2_1_LEN)-1)<<TIMER_TIER2_1_POS)
#define TIMER_TIER2_1_UMSK                                      (~(((1U<<TIMER_TIER2_1_LEN)-1)<<TIMER_TIER2_1_POS))
#define TIMER_TIER2_2                                           TIMER_TIER2_2
#define TIMER_TIER2_2_POS                                       (2U)
#define TIMER_TIER2_2_LEN                                       (1U)
#define TIMER_TIER2_2_MSK                                       (((1U<<TIMER_TIER2_2_LEN)-1)<<TIMER_TIER2_2_POS)
#define TIMER_TIER2_2_UMSK                                      (~(((1U<<TIMER_TIER2_2_LEN)-1)<<TIMER_TIER2_2_POS))

/* 0x48 : Timer3 Match Interrupt Enable */
#define TIMER_TIER3_OFFSET                                      (0x48)
#define TIMER_TIER3_0                                           TIMER_TIER3_0
#define TIMER_TIER3_0_POS                                       (0U)
#define TIMER_TIER3_0_LEN                                       (1U)
#define TIMER_TIER3_0_MSK                                       (((1U<<TIMER_TIER3_0_LEN)-1)<<TIMER_TIER3_0_POS)
#define TIMER_TIER3_0_UMSK                                      (~(((1U<<TIMER_TIER3_0_LEN)-1)<<TIMER_TIER3_0_POS))
#define TIMER_TIER3_1                                           TIMER_TIER3_1
#define TIMER_TIER3_1_POS                                       (1U)
#define TIMER_TIER3_1_LEN                                       (1U)
#define TIMER_TIER3_1_MSK                                       (((1U<<TIMER_TIER3_1_LEN)-1)<<TIMER_TIER3_1_POS)
#define TIMER_TIER3_1_UMSK                                      (~(((1U<<TIMER_TIER3_1_LEN)-1)<<TIMER_TIER3_1_POS))
#define TIMER_TIER3_2                                           TIMER_TIER3_2
#define TIMER_TIER3_2_POS                                       (2U)
#define TIMER_TIER3_2_LEN                                       (1U)
#define TIMER_TIER3_2_MSK                                       (((1U<<TIMER_TIER3_2_LEN)-1)<<TIMER_TIER3_2_POS)
#define TIMER_TIER3_2_UMSK                                      (~(((1U<<TIMER_TIER3_2_LEN)-1)<<TIMER_TIER3_2_POS))

/* 0x50 : Timer2 Pre-Load Value */
#define TIMER_TPLVR2_OFFSET                                     (0x50)
#define TIMER_TPLVR2                                            TIMER_TPLVR2
#define TIMER_TPLVR2_POS                                        (0U)
#define TIMER_TPLVR2_LEN                                        (32U)
#define TIMER_TPLVR2_MSK                                        (((1U<<TIMER_TPLVR2_LEN)-1)<<TIMER_TPLVR2_POS)
#define TIMER_TPLVR2_UMSK                                       (~(((1U<<TIMER_TPLVR2_LEN)-1)<<TIMER_TPLVR2_POS))

/* 0x54 : Timer3 Pre-Load Value */
#define TIMER_TPLVR3_OFFSET                                     (0x54)
#define TIMER_TPLVR3                                            TIMER_TPLVR3
#define TIMER_TPLVR3_POS                                        (0U)
#define TIMER_TPLVR3_LEN                                        (32U)
#define TIMER_TPLVR3_MSK                                        (((1U<<TIMER_TPLVR3_LEN)-1)<<TIMER_TPLVR3_POS)
#define TIMER_TPLVR3_UMSK                                       (~(((1U<<TIMER_TPLVR3_LEN)-1)<<TIMER_TPLVR3_POS))

