bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/timer_reg.h
/* 0x5C : Timer2 Pre-Load Control */
#define TIMER_TPLCR2_OFFSET                                     (0x5C)
#define TIMER_TPLCR2                                            TIMER_TPLCR2
#define TIMER_TPLCR2_POS                                        (0U)
#define TIMER_TPLCR2_LEN                                        (2U)
#define TIMER_TPLCR2_MSK                                        (((1U<<TIMER_TPLCR2_LEN)-1)<<TIMER_TPLCR2_POS)
#define TIMER_TPLCR2_UMSK                                       (~(((1U<<TIMER_TPLCR2_LEN)-1)<<TIMER_TPLCR2_POS))

/* 0x60 : Timer3 Pre-Load Control */
#define TIMER_TPLCR3_OFFSET                                     (0x60)
#define TIMER_TPLCR3                                            TIMER_TPLCR3
#define TIMER_TPLCR3_POS                                        (0U)
#define TIMER_TPLCR3_LEN                                        (2U)
#define TIMER_TPLCR3_MSK                                        (((1U<<TIMER_TPLCR3_LEN)-1)<<TIMER_TPLCR3_POS)
#define TIMER_TPLCR3_UMSK                                       (~(((1U<<TIMER_TPLCR3_LEN)-1)<<TIMER_TPLCR3_POS))

/* 0x64 : Watch-dog reset/interrupt Mode */
#define TIMER_WMER_OFFSET                                       (0x64)
#define TIMER_WE                                                TIMER_WE
#define TIMER_WE_POS                                            (0U)
#define TIMER_WE_LEN                                            (1U)
#define TIMER_WE_MSK                                            (((1U<<TIMER_WE_LEN)-1)<<TIMER_WE_POS)
#define TIMER_WE_UMSK                                           (~(((1U<<TIMER_WE_LEN)-1)<<TIMER_WE_POS))
#define TIMER_WRIE                                              TIMER_WRIE
#define TIMER_WRIE_POS                                          (1U)
#define TIMER_WRIE_LEN                                          (1U)
#define TIMER_WRIE_MSK                                          (((1U<<TIMER_WRIE_LEN)-1)<<TIMER_WRIE_POS)
#define TIMER_WRIE_UMSK                                         (~(((1U<<TIMER_WRIE_LEN)-1)<<TIMER_WRIE_POS))

/* 0x68 : Watch-dog Match Value */
#define TIMER_WMR_OFFSET                                        (0x68)
#define TIMER_WMR                                               TIMER_WMR
#define TIMER_WMR_POS                                           (0U)
#define TIMER_WMR_LEN                                           (16U)
#define TIMER_WMR_MSK                                           (((1U<<TIMER_WMR_LEN)-1)<<TIMER_WMR_POS)
#define TIMER_WMR_UMSK                                          (~(((1U<<TIMER_WMR_LEN)-1)<<TIMER_WMR_POS))
#define TIMER_WDT_ALIGN                                         TIMER_WDT_ALIGN
#define TIMER_WDT_ALIGN_POS                                     (16U)
#define TIMER_WDT_ALIGN_LEN                                     (1U)
#define TIMER_WDT_ALIGN_MSK                                     (((1U<<TIMER_WDT_ALIGN_LEN)-1)<<TIMER_WDT_ALIGN_POS)
#define TIMER_WDT_ALIGN_UMSK                                    (~(((1U<<TIMER_WDT_ALIGN_LEN)-1)<<TIMER_WDT_ALIGN_POS))

/* 0x6C : Watch-dog Counter Value */
#define TIMER_WVR_OFFSET                                        (0x6C)
#define TIMER_WDT_CNT                                           TIMER_WDT_CNT
#define TIMER_WDT_CNT_POS                                       (0U)
#define TIMER_WDT_CNT_LEN                                       (16U)
#define TIMER_WDT_CNT_MSK                                       (((1U<<TIMER_WDT_CNT_LEN)-1)<<TIMER_WDT_CNT_POS)
#define TIMER_WDT_CNT_UMSK                                      (~(((1U<<TIMER_WDT_CNT_LEN)-1)<<TIMER_WDT_CNT_POS))

/* 0x70 : Watch-dog Reset Status */
#define TIMER_WSR_OFFSET                                        (0x70)
#define TIMER_WTS                                               TIMER_WTS
#define TIMER_WTS_POS                                           (0U)
#define TIMER_WTS_LEN                                           (1U)
#define TIMER_WTS_MSK                                           (((1U<<TIMER_WTS_LEN)-1)<<TIMER_WTS_POS)
#define TIMER_WTS_UMSK                                          (~(((1U<<TIMER_WTS_LEN)-1)<<TIMER_WTS_POS))

/* 0x78 : Timer2 Interrupt Clear */
#define TIMER_TICR2_OFFSET                                      (0x78)
#define TIMER_TCLR2_0                                           TIMER_TCLR2_0
#define TIMER_TCLR2_0_POS                                       (0U)
#define TIMER_TCLR2_0_LEN                                       (1U)
#define TIMER_TCLR2_0_MSK                                       (((1U<<TIMER_TCLR2_0_LEN)-1)<<TIMER_TCLR2_0_POS)
#define TIMER_TCLR2_0_UMSK                                      (~(((1U<<TIMER_TCLR2_0_LEN)-1)<<TIMER_TCLR2_0_POS))
#define TIMER_TCLR2_1                                           TIMER_TCLR2_1
#define TIMER_TCLR2_1_POS                                       (1U)
#define TIMER_TCLR2_1_LEN                                       (1U)
#define TIMER_TCLR2_1_MSK                                       (((1U<<TIMER_TCLR2_1_LEN)-1)<<TIMER_TCLR2_1_POS)
#define TIMER_TCLR2_1_UMSK                                      (~(((1U<<TIMER_TCLR2_1_LEN)-1)<<TIMER_TCLR2_1_POS))
#define TIMER_TCLR2_2                                           TIMER_TCLR2_2
#define TIMER_TCLR2_2_POS                                       (2U)
#define TIMER_TCLR2_2_LEN                                       (1U)
#define TIMER_TCLR2_2_MSK                                       (((1U<<TIMER_TCLR2_2_LEN)-1)<<TIMER_TCLR2_2_POS)
#define TIMER_TCLR2_2_UMSK                                      (~(((1U<<TIMER_TCLR2_2_LEN)-1)<<TIMER_TCLR2_2_POS))

/* 0x7C : Timer3 Interrupt Clear */
#define TIMER_TICR3_OFFSET                                      (0x7C)
#define TIMER_TCLR3_0                                           TIMER_TCLR3_0
#define TIMER_TCLR3_0_POS                                       (0U)
#define TIMER_TCLR3_0_LEN                                       (1U)
#define TIMER_TCLR3_0_MSK                                       (((1U<<TIMER_TCLR3_0_LEN)-1)<<TIMER_TCLR3_0_POS)
#define TIMER_TCLR3_0_UMSK                                      (~(((1U<<TIMER_TCLR3_0_LEN)-1)<<TIMER_TCLR3_0_POS))
#define TIMER_TCLR3_1                                           TIMER_TCLR3_1
#define TIMER_TCLR3_1_POS                                       (1U)
#define TIMER_TCLR3_1_LEN                                       (1U)
#define TIMER_TCLR3_1_MSK                                       (((1U<<TIMER_TCLR3_1_LEN)-1)<<TIMER_TCLR3_1_POS)
#define TIMER_TCLR3_1_UMSK                                      (~(((1U<<TIMER_TCLR3_1_LEN)-1)<<TIMER_TCLR3_1_POS))
#define TIMER_TCLR3_2                                           TIMER_TCLR3_2
#define TIMER_TCLR3_2_POS                                       (2U)
#define TIMER_TCLR3_2_LEN                                       (1U)
#define TIMER_TCLR3_2_MSK                                       (((1U<<TIMER_TCLR3_2_LEN)-1)<<TIMER_TCLR3_2_POS)
#define TIMER_TCLR3_2_UMSK                                      (~(((1U<<TIMER_TCLR3_2_LEN)-1)<<TIMER_TCLR3_2_POS))

