bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/timer_reg.h
/* 0x80 : WDT Interrupt Clear */
#define TIMER_WICR_OFFSET                                       (0x80)
#define TIMER_WICLR                                             TIMER_WICLR
#define TIMER_WICLR_POS                                         (0U)
#define TIMER_WICLR_LEN                                         (1U)
#define TIMER_WICLR_MSK                                         (((1U<<TIMER_WICLR_LEN)-1)<<TIMER_WICLR_POS)
#define TIMER_WICLR_UMSK                                        (~(((1U<<TIMER_WICLR_LEN)-1)<<TIMER_WICLR_POS))

/* 0x84 : Timer Counter Enable/Clear */
#define TIMER_TCER_OFFSET                                       (0x84)
#define TIMER2_EN                                               TIMER2_EN
#define TIMER2_EN_POS                                           (1U)
#define TIMER2_EN_LEN                                           (1U)
#define TIMER2_EN_MSK                                           (((1U<<TIMER2_EN_LEN)-1)<<TIMER2_EN_POS)
#define TIMER2_EN_UMSK                                          (~(((1U<<TIMER2_EN_LEN)-1)<<TIMER2_EN_POS))
#define TIMER3_EN                                               TIMER3_EN
#define TIMER3_EN_POS                                           (2U)
#define TIMER3_EN_LEN                                           (1U)
#define TIMER3_EN_MSK                                           (((1U<<TIMER3_EN_LEN)-1)<<TIMER3_EN_POS)
#define TIMER3_EN_UMSK                                          (~(((1U<<TIMER3_EN_LEN)-1)<<TIMER3_EN_POS))
#define TIMER_TCR2_CNT_CLR                                      TIMER_TCR2_CNT_CLR
#define TIMER_TCR2_CNT_CLR_POS                                  (5U)
#define TIMER_TCR2_CNT_CLR_LEN                                  (1U)
#define TIMER_TCR2_CNT_CLR_MSK                                  (((1U<<TIMER_TCR2_CNT_CLR_LEN)-1)<<TIMER_TCR2_CNT_CLR_POS)
#define TIMER_TCR2_CNT_CLR_UMSK                                 (~(((1U<<TIMER_TCR2_CNT_CLR_LEN)-1)<<TIMER_TCR2_CNT_CLR_POS))
#define TIMER_TCR3_CNT_CLR                                      TIMER_TCR3_CNT_CLR
#define TIMER_TCR3_CNT_CLR_POS                                  (6U)
#define TIMER_TCR3_CNT_CLR_LEN                                  (1U)
#define TIMER_TCR3_CNT_CLR_MSK                                  (((1U<<TIMER_TCR3_CNT_CLR_LEN)-1)<<TIMER_TCR3_CNT_CLR_POS)
#define TIMER_TCR3_CNT_CLR_UMSK                                 (~(((1U<<TIMER_TCR3_CNT_CLR_LEN)-1)<<TIMER_TCR3_CNT_CLR_POS))

/* 0x88 : Timer Counter Mode */
#define TIMER_TCMR_OFFSET                                       (0x88)
#define TIMER2_MODE                                             TIMER2_MODE
#define TIMER2_MODE_POS                                         (1U)
#define TIMER2_MODE_LEN                                         (1U)
#define TIMER2_MODE_MSK                                         (((1U<<TIMER2_MODE_LEN)-1)<<TIMER2_MODE_POS)
#define TIMER2_MODE_UMSK                                        (~(((1U<<TIMER2_MODE_LEN)-1)<<TIMER2_MODE_POS))
#define TIMER3_MODE                                             TIMER3_MODE
#define TIMER3_MODE_POS                                         (2U)
#define TIMER3_MODE_LEN                                         (1U)
#define TIMER3_MODE_MSK                                         (((1U<<TIMER3_MODE_LEN)-1)<<TIMER3_MODE_POS)
#define TIMER3_MODE_UMSK                                        (~(((1U<<TIMER3_MODE_LEN)-1)<<TIMER3_MODE_POS))
#define TIMER2_ALIGN                                            TIMER2_ALIGN
#define TIMER2_ALIGN_POS                                        (5U)
#define TIMER2_ALIGN_LEN                                        (1U)
#define TIMER2_ALIGN_MSK                                        (((1U<<TIMER2_ALIGN_LEN)-1)<<TIMER2_ALIGN_POS)
#define TIMER2_ALIGN_UMSK                                       (~(((1U<<TIMER2_ALIGN_LEN)-1)<<TIMER2_ALIGN_POS))
#define TIMER3_ALIGN                                            TIMER3_ALIGN
#define TIMER3_ALIGN_POS                                        (6U)
#define TIMER3_ALIGN_LEN                                        (1U)
#define TIMER3_ALIGN_MSK                                        (((1U<<TIMER3_ALIGN_LEN)-1)<<TIMER3_ALIGN_POS)
#define TIMER3_ALIGN_UMSK                                       (~(((1U<<TIMER3_ALIGN_LEN)-1)<<TIMER3_ALIGN_POS))

/* 0x90 : Timer2 Match Interrupt Mode */
#define TIMER_TILR2_OFFSET                                      (0x90)
#define TIMER_TILR2_0                                           TIMER_TILR2_0
#define TIMER_TILR2_0_POS                                       (0U)
#define TIMER_TILR2_0_LEN                                       (1U)
#define TIMER_TILR2_0_MSK                                       (((1U<<TIMER_TILR2_0_LEN)-1)<<TIMER_TILR2_0_POS)
#define TIMER_TILR2_0_UMSK                                      (~(((1U<<TIMER_TILR2_0_LEN)-1)<<TIMER_TILR2_0_POS))
#define TIMER_TILR2_1                                           TIMER_TILR2_1
#define TIMER_TILR2_1_POS                                       (1U)
#define TIMER_TILR2_1_LEN                                       (1U)
#define TIMER_TILR2_1_MSK                                       (((1U<<TIMER_TILR2_1_LEN)-1)<<TIMER_TILR2_1_POS)
#define TIMER_TILR2_1_UMSK                                      (~(((1U<<TIMER_TILR2_1_LEN)-1)<<TIMER_TILR2_1_POS))
#define TIMER_TILR2_2                                           TIMER_TILR2_2
#define TIMER_TILR2_2_POS                                       (2U)
#define TIMER_TILR2_2_LEN                                       (1U)
#define TIMER_TILR2_2_MSK                                       (((1U<<TIMER_TILR2_2_LEN)-1)<<TIMER_TILR2_2_POS)
#define TIMER_TILR2_2_UMSK                                      (~(((1U<<TIMER_TILR2_2_LEN)-1)<<TIMER_TILR2_2_POS))

/* 0x94 : Timer3 Match Interrupt Mode */
#define TIMER_TILR3_OFFSET                                      (0x94)
#define TIMER_TILR3_0                                           TIMER_TILR3_0
#define TIMER_TILR3_0_POS                                       (0U)
#define TIMER_TILR3_0_LEN                                       (1U)
#define TIMER_TILR3_0_MSK                                       (((1U<<TIMER_TILR3_0_LEN)-1)<<TIMER_TILR3_0_POS)
#define TIMER_TILR3_0_UMSK                                      (~(((1U<<TIMER_TILR3_0_LEN)-1)<<TIMER_TILR3_0_POS))
#define TIMER_TILR3_1                                           TIMER_TILR3_1
#define TIMER_TILR3_1_POS                                       (1U)
#define TIMER_TILR3_1_LEN                                       (1U)
#define TIMER_TILR3_1_MSK                                       (((1U<<TIMER_TILR3_1_LEN)-1)<<TIMER_TILR3_1_POS)
#define TIMER_TILR3_1_UMSK                                      (~(((1U<<TIMER_TILR3_1_LEN)-1)<<TIMER_TILR3_1_POS))
#define TIMER_TILR3_2                                           TIMER_TILR3_2
#define TIMER_TILR3_2_POS                                       (2U)
#define TIMER_TILR3_2_LEN                                       (1U)
#define TIMER_TILR3_2_MSK                                       (((1U<<TIMER_TILR3_2_LEN)-1)<<TIMER_TILR3_2_POS)
#define TIMER_TILR3_2_UMSK                                      (~(((1U<<TIMER_TILR3_2_LEN)-1)<<TIMER_TILR3_2_POS))

