bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/timer_reg.h
/* 0x98 : WDT Counter Reset */
#define TIMER_WCR_OFFSET                                        (0x98)
#define TIMER_WCR                                               TIMER_WCR
#define TIMER_WCR_POS                                           (0U)
#define TIMER_WCR_LEN                                           (1U)
#define TIMER_WCR_MSK                                           (((1U<<TIMER_WCR_LEN)-1)<<TIMER_WCR_POS)
#define TIMER_WCR_UMSK                                          (~(((1U<<TIMER_WCR_LEN)-1)<<TIMER_WCR_POS))

/* 0x9C : WDT Access Key1 */
#define TIMER_WFAR_OFFSET                                       (0x9C)
#define TIMER_WFAR                                              TIMER_WFAR
#define TIMER_WFAR_POS                                          (0U)
#define TIMER_WFAR_LEN                                          (16U)
#define TIMER_WFAR_MSK                                          (((1U<<TIMER_WFAR_LEN)-1)<<TIMER_WFAR_POS)
#define TIMER_WFAR_UMSK                                         (~(((1U<<TIMER_WFAR_LEN)-1)<<TIMER_WFAR_POS))

/* 0xA0 : WDT Access Key2 */
#define TIMER_WSAR_OFFSET                                       (0xA0)
#define TIMER_WSAR                                              TIMER_WSAR
#define TIMER_WSAR_POS                                          (0U)
#define TIMER_WSAR_LEN                                          (16U)
#define TIMER_WSAR_MSK                                          (((1U<<TIMER_WSAR_LEN)-1)<<TIMER_WSAR_POS)
#define TIMER_WSAR_UMSK                                         (~(((1U<<TIMER_WSAR_LEN)-1)<<TIMER_WSAR_POS))

/* 0xA8 : Timer2 Counter Latch Value */
#define TIMER_TCVWR2_OFFSET                                     (0xA8)
#define TIMER_TCR2_CNT_LAT                                      TIMER_TCR2_CNT_LAT
#define TIMER_TCR2_CNT_LAT_POS                                  (0U)
#define TIMER_TCR2_CNT_LAT_LEN                                  (32U)
#define TIMER_TCR2_CNT_LAT_MSK                                  (((1U<<TIMER_TCR2_CNT_LAT_LEN)-1)<<TIMER_TCR2_CNT_LAT_POS)
#define TIMER_TCR2_CNT_LAT_UMSK                                 (~(((1U<<TIMER_TCR2_CNT_LAT_LEN)-1)<<TIMER_TCR2_CNT_LAT_POS))

/* 0xAC : Timer3 Counter Latch Value */
#define TIMER_TCVWR3_OFFSET                                     (0xAC)
#define TIMER_TCR3_CNT_LAT                                      TIMER_TCR3_CNT_LAT
#define TIMER_TCR3_CNT_LAT_POS                                  (0U)
#define TIMER_TCR3_CNT_LAT_LEN                                  (32U)
#define TIMER_TCR3_CNT_LAT_MSK                                  (((1U<<TIMER_TCR3_CNT_LAT_LEN)-1)<<TIMER_TCR3_CNT_LAT_POS)
#define TIMER_TCR3_CNT_LAT_UMSK                                 (~(((1U<<TIMER_TCR3_CNT_LAT_LEN)-1)<<TIMER_TCR3_CNT_LAT_POS))

/* 0xB4 : Timer2 Counter Sync Value */
#define TIMER_TCVSYN2_OFFSET                                    (0xB4)
#define TIMER_TCR2_CNT_SYNC                                     TIMER_TCR2_CNT_SYNC
#define TIMER_TCR2_CNT_SYNC_POS                                 (0U)
#define TIMER_TCR2_CNT_SYNC_LEN                                 (32U)
#define TIMER_TCR2_CNT_SYNC_MSK                                 (((1U<<TIMER_TCR2_CNT_SYNC_LEN)-1)<<TIMER_TCR2_CNT_SYNC_POS)
#define TIMER_TCR2_CNT_SYNC_UMSK                                (~(((1U<<TIMER_TCR2_CNT_SYNC_LEN)-1)<<TIMER_TCR2_CNT_SYNC_POS))

/* 0xB8 : Timer3 Counter Sync Value */
#define TIMER_TCVSYN3_OFFSET                                    (0xB8)
#define TIMER_TCR3_CNT_SYNC                                     TIMER_TCR3_CNT_SYNC
#define TIMER_TCR3_CNT_SYNC_POS                                 (0U)
#define TIMER_TCR3_CNT_SYNC_LEN                                 (32U)
#define TIMER_TCR3_CNT_SYNC_MSK                                 (((1U<<TIMER_TCR3_CNT_SYNC_LEN)-1)<<TIMER_TCR3_CNT_SYNC_POS)
#define TIMER_TCR3_CNT_SYNC_UMSK                                (~(((1U<<TIMER_TCR3_CNT_SYNC_LEN)-1)<<TIMER_TCR3_CNT_SYNC_POS))

/* 0xBC : Timer Division */
#define TIMER_TCDR_OFFSET                                       (0xBC)
#define TIMER_TCDR2                                             TIMER_TCDR2
#define TIMER_TCDR2_POS                                         (8U)
#define TIMER_TCDR2_LEN                                         (8U)
#define TIMER_TCDR2_MSK                                         (((1U<<TIMER_TCDR2_LEN)-1)<<TIMER_TCDR2_POS)
#define TIMER_TCDR2_UMSK                                        (~(((1U<<TIMER_TCDR2_LEN)-1)<<TIMER_TCDR2_POS))
#define TIMER_TCDR3                                             TIMER_TCDR3
#define TIMER_TCDR3_POS                                         (16U)
#define TIMER_TCDR3_LEN                                         (8U)
#define TIMER_TCDR3_MSK                                         (((1U<<TIMER_TCDR3_LEN)-1)<<TIMER_TCDR3_POS)
#define TIMER_TCDR3_UMSK                                        (~(((1U<<TIMER_TCDR3_LEN)-1)<<TIMER_TCDR3_POS))
#define TIMER_WCDR                                              TIMER_WCDR
#define TIMER_WCDR_POS                                          (24U)
#define TIMER_WCDR_LEN                                          (8U)
#define TIMER_WCDR_MSK                                          (((1U<<TIMER_WCDR_LEN)-1)<<TIMER_WCDR_POS)
#define TIMER_WCDR_UMSK                                         (~(((1U<<TIMER_WCDR_LEN)-1)<<TIMER_WCDR_POS))

/* 0xC0 : GPIO Mode */
#define TIMER_GPIO_OFFSET                                       (0xC0)
#define TIMER2_GPIO_EN                                          TIMER2_GPIO_EN
#define TIMER2_GPIO_EN_POS                                      (1U)
#define TIMER2_GPIO_EN_LEN                                      (1U)
#define TIMER2_GPIO_EN_MSK                                      (((1U<<TIMER2_GPIO_EN_LEN)-1)<<TIMER2_GPIO_EN_POS)
#define TIMER2_GPIO_EN_UMSK                                     (~(((1U<<TIMER2_GPIO_EN_LEN)-1)<<TIMER2_GPIO_EN_POS))
#define TIMER2_GPIO_INV                                         TIMER2_GPIO_INV
#define TIMER2_GPIO_INV_POS                                     (5U)
#define TIMER2_GPIO_INV_LEN                                     (1U)
#define TIMER2_GPIO_INV_MSK                                     (((1U<<TIMER2_GPIO_INV_LEN)-1)<<TIMER2_GPIO_INV_POS)
#define TIMER2_GPIO_INV_UMSK                                    (~(((1U<<TIMER2_GPIO_INV_LEN)-1)<<TIMER2_GPIO_INV_POS))
#define TIMER3_GPIO_INV                                         TIMER3_GPIO_INV
#define TIMER3_GPIO_INV_POS                                     (6U)
#define TIMER3_GPIO_INV_LEN                                     (1U)
#define TIMER3_GPIO_INV_MSK                                     (((1U<<TIMER3_GPIO_INV_LEN)-1)<<TIMER3_GPIO_INV_POS)
#define TIMER3_GPIO_INV_UMSK                                    (~(((1U<<TIMER3_GPIO_INV_LEN)-1)<<TIMER3_GPIO_INV_POS))
#define TIMER_WDT_GPIO_INV                                      TIMER_WDT_GPIO_INV
#define TIMER_WDT_GPIO_INV_POS                                  (7U)
#define TIMER_WDT_GPIO_INV_LEN                                  (1U)
#define TIMER_WDT_GPIO_INV_MSK                                  (((1U<<TIMER_WDT_GPIO_INV_LEN)-1)<<TIMER_WDT_GPIO_INV_POS)
#define TIMER_WDT_GPIO_INV_UMSK                                 (~(((1U<<TIMER_WDT_GPIO_INV_LEN)-1)<<TIMER_WDT_GPIO_INV_POS))
#define TIMER_GPIO_LAT_OK                                       TIMER_GPIO_LAT_OK
#define TIMER_GPIO_LAT_OK_POS                                   (31U)
#define TIMER_GPIO_LAT_OK_LEN                                   (1U)
#define TIMER_GPIO_LAT_OK_MSK                                   (((1U<<TIMER_GPIO_LAT_OK_LEN)-1)<<TIMER_GPIO_LAT_OK_POS)
#define TIMER_GPIO_LAT_OK_UMSK                                  (~(((1U<<TIMER_GPIO_LAT_OK_LEN)-1)<<TIMER_GPIO_LAT_OK_POS))

/* 0xC4 : GPIO Latch Value1 */
#define TIMER_GPIO_LAT1_OFFSET                                  (0xC4)
#define TIMER_GPIO_LAT1                                         TIMER_GPIO_LAT1
#define TIMER_GPIO_LAT1_POS                                     (0U)
#define TIMER_GPIO_LAT1_LEN                                     (32U)
#define TIMER_GPIO_LAT1_MSK                                     (((1U<<TIMER_GPIO_LAT1_LEN)-1)<<TIMER_GPIO_LAT1_POS)
#define TIMER_GPIO_LAT1_UMSK                                    (~(((1U<<TIMER_GPIO_LAT1_LEN)-1)<<TIMER_GPIO_LAT1_POS))

/* 0xC8 : GPIO Latch Value2 */
#define TIMER_GPIO_LAT2_OFFSET                                  (0xC8)
#define TIMER_GPIO_LAT2                                         TIMER_GPIO_LAT2
#define TIMER_GPIO_LAT2_POS                                     (0U)
#define TIMER_GPIO_LAT2_LEN                                     (32U)
#define TIMER_GPIO_LAT2_MSK                                     (((1U<<TIMER_GPIO_LAT2_LEN)-1)<<TIMER_GPIO_LAT2_POS)
#define TIMER_GPIO_LAT2_UMSK                                    (~(((1U<<TIMER_GPIO_LAT2_LEN)-1)<<TIMER_GPIO_LAT2_POS))

