bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/timer_reg.h
/* 0xCC : Timer Division Force */
#define TIMER_TCDR_FORCE_OFFSET                                 (0xCC)
#define TIMER_TCDR2_FORCE                                       TIMER_TCDR2_FORCE
#define TIMER_TCDR2_FORCE_POS                                   (1U)
#define TIMER_TCDR2_FORCE_LEN                                   (1U)
#define TIMER_TCDR2_FORCE_MSK                                   (((1U<<TIMER_TCDR2_FORCE_LEN)-1)<<TIMER_TCDR2_FORCE_POS)
#define TIMER_TCDR2_FORCE_UMSK                                  (~(((1U<<TIMER_TCDR2_FORCE_LEN)-1)<<TIMER_TCDR2_FORCE_POS))
#define TIMER_TCDR3_FORCE                                       TIMER_TCDR3_FORCE
#define TIMER_TCDR3_FORCE_POS                                   (2U)
#define TIMER_TCDR3_FORCE_LEN                                   (1U)
#define TIMER_TCDR3_FORCE_MSK                                   (((1U<<TIMER_TCDR3_FORCE_LEN)-1)<<TIMER_TCDR3_FORCE_POS)
#define TIMER_TCDR3_FORCE_UMSK                                  (~(((1U<<TIMER_TCDR3_FORCE_LEN)-1)<<TIMER_TCDR3_FORCE_POS))
#define TIMER_WCDR_FORCE                                        TIMER_WCDR_FORCE
#define TIMER_WCDR_FORCE_POS                                    (4U)
#define TIMER_WCDR_FORCE_LEN                                    (1U)
#define TIMER_WCDR_FORCE_MSK                                    (((1U<<TIMER_WCDR_FORCE_LEN)-1)<<TIMER_WCDR_FORCE_POS)
#define TIMER_WCDR_FORCE_UMSK                                   (~(((1U<<TIMER_WCDR_FORCE_LEN)-1)<<TIMER_WCDR_FORCE_POS))


struct  timer_reg {
    /* 0x0 : Timer Clock Source */
    union {
        struct {
            uint32_t cs_2                           :  4; /* [ 3: 0],        r/w,        0x5 */
            uint32_t cs_3                           :  4; /* [ 7: 4],        r/w,        0x5 */
            uint32_t cs_wdt                         :  4; /* [11: 8],        r/w,        0x1 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t tmr_rsv                        :  8; /* [23:16],       rsvd,        0x0 */
            uint32_t ID                             :  8; /* [31:24],          r,       0xa5 */
        }BF;
        uint32_t WORD;
    } TCCR;

    /* 0x4  reserved */
    uint8_t RESERVED0x4[12];

    /* 0x10 : Timer2 Match Value 0 */
    union {
        struct {
            uint32_t tmr2_0                         : 32; /* [31: 0],        r/w, 0xffffffff */
        }BF;
        uint32_t WORD;
    } TMR2_0;

    /* 0x14 : Timer2 Match Value 1 */
    union {
        struct {
            uint32_t tmr2_1                         : 32; /* [31: 0],        r/w, 0xffffffff */
        }BF;
        uint32_t WORD;
    } TMR2_1;

    /* 0x18 : Timer2 Match Value 2 */
    union {
        struct {
            uint32_t tmr2_2                         : 32; /* [31: 0],        r/w, 0xffffffff */
        }BF;
        uint32_t WORD;
    } TMR2_2;

    /* 0x1C : Timer3 Match Value 0 */
    union {
        struct {
            uint32_t tmr3_0                         : 32; /* [31: 0],        r/w, 0xffffffff */
        }BF;
        uint32_t WORD;
    } TMR3_0;

    /* 0x20 : Timer3 Match Value 1 */
    union {
        struct {
            uint32_t tmr3_1                         : 32; /* [31: 0],        r/w, 0xffffffff */
        }BF;
        uint32_t WORD;
    } TMR3_1;

    /* 0x24 : Timer3 Match Value 2 */
    union {
        struct {
            uint32_t tmr3_2                         : 32; /* [31: 0],        r/w, 0xffffffff */
        }BF;
        uint32_t WORD;
    } TMR3_2;

    /* 0x28  reserved */
    uint8_t RESERVED0x28[4];

    /* 0x2C : Timer2 Counter Value */
    union {
        struct {
            uint32_t tcr2_cnt                       : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } TCR2;

    /* 0x30 : Timer3 Counter Value */
    union {
        struct {
            uint32_t tcr3_cnt                       : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } TCR3;

    /* 0x34  reserved */
    uint8_t RESERVED0x34[4];

    /* 0x38 : Timer2 Match Status */
    union {
        struct {
            uint32_t tsr2_0                         :  1; /* [    0],          r,        0x0 */
            uint32_t tsr2_1                         :  1; /* [    1],          r,        0x0 */
            uint32_t tsr2_2                         :  1; /* [    2],          r,        0x0 */
            uint32_t reserved_3_31                  : 29; /* [31: 3],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } TSR2;

    /* 0x3C : Timer3 Match Status */
    union {
        struct {
            uint32_t tsr3_0                         :  1; /* [    0],          r,        0x0 */
            uint32_t tsr3_1                         :  1; /* [    1],          r,        0x0 */
            uint32_t tsr3_2                         :  1; /* [    2],          r,        0x0 */
            uint32_t reserved_3_31                  : 29; /* [31: 3],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } TSR3;

    /* 0x40  reserved */
    uint8_t RESERVED0x40[4];

    /* 0x44 : Timer2 Match Interrupt Enable */
    union {
        struct {
            uint32_t tier2_0                        :  1; /* [    0],        r/w,        0x0 */
            uint32_t tier2_1                        :  1; /* [    1],        r/w,        0x0 */
            uint32_t tier2_2                        :  1; /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_31                  : 29; /* [31: 3],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } TIER2;

    /* 0x48 : Timer3 Match Interrupt Enable */
    union {
        struct {
            uint32_t tier3_0                        :  1; /* [    0],        r/w,        0x0 */
            uint32_t tier3_1                        :  1; /* [    1],        r/w,        0x0 */
            uint32_t tier3_2                        :  1; /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_31                  : 29; /* [31: 3],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } TIER3;

