bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/timer_reg.h
    /* 0x4c  reserved */
    uint8_t RESERVED0x4c[4];

    /* 0x50 : Timer2 Pre-Load Value */
    union {
        struct {
            uint32_t tplvr2                         : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } TPLVR2;

    /* 0x54 : Timer3 Pre-Load Value */
    union {
        struct {
            uint32_t tplvr3                         : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } TPLVR3;

    /* 0x58  reserved */
    uint8_t RESERVED0x58[4];

    /* 0x5C : Timer2 Pre-Load Control */
    union {
        struct {
            uint32_t tplcr2                         :  2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_31                  : 30; /* [31: 2],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } TPLCR2;

    /* 0x60 : Timer3 Pre-Load Control */
    union {
        struct {
            uint32_t tplcr3                         :  2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_31                  : 30; /* [31: 2],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } TPLCR3;

    /* 0x64 : Watch-dog reset/interrupt Mode */
    union {
        struct {
            uint32_t we                             :  1; /* [    0],        r/w,        0x0 */
            uint32_t wrie                           :  1; /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_31                  : 30; /* [31: 2],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } WMER;

    /* 0x68 : Watch-dog Match Value */
    union {
        struct {
            uint32_t wmr                            : 16; /* [15: 0],        r/w,     0xffff */
            uint32_t wdt_align                      :  1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31                 : 15; /* [31:17],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } WMR;

    /* 0x6C : Watch-dog Counter Value */
    union {
        struct {
            uint32_t wdt_cnt                        : 16; /* [15: 0],          r,        0x0 */
            uint32_t reserved_16_31                 : 16; /* [31:16],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } WVR;

    /* 0x70 : Watch-dog Reset Status */
    union {
        struct {
            uint32_t wts                            :  1; /* [    0],          w,        0x0 */
            uint32_t reserved_1_31                  : 31; /* [31: 1],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } WSR;

    /* 0x74  reserved */
    uint8_t RESERVED0x74[4];

    /* 0x78 : Timer2 Interrupt Clear */
    union {
        struct {
            uint32_t tclr2_0                        :  1; /* [    0],          w,        0x0 */
            uint32_t tclr2_1                        :  1; /* [    1],          w,        0x0 */
            uint32_t tclr2_2                        :  1; /* [    2],          w,        0x0 */
            uint32_t reserved_3_31                  : 29; /* [31: 3],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } TICR2;

    /* 0x7C : Timer3 Interrupt Clear */
    union {
        struct {
            uint32_t tclr3_0                        :  1; /* [    0],          w,        0x0 */
            uint32_t tclr3_1                        :  1; /* [    1],          w,        0x0 */
            uint32_t tclr3_2                        :  1; /* [    2],          w,        0x0 */
            uint32_t reserved_3_31                  : 29; /* [31: 3],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } TICR3;

    /* 0x80 : WDT Interrupt Clear */
    union {
        struct {
            uint32_t wiclr                          :  1; /* [    0],          w,        0x0 */
            uint32_t reserved_1_31                  : 31; /* [31: 1],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } WICR;

    /* 0x84 : Timer Counter Enable/Clear */
    union {
        struct {
            uint32_t reserved_0                     :  1; /* [    0],       rsvd,        0x0 */
            uint32_t timer2_en                      :  1; /* [    1],        r/w,        0x0 */
            uint32_t timer3_en                      :  1; /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_4                   :  2; /* [ 4: 3],       rsvd,        0x0 */
            uint32_t tcr2_cnt_clr                   :  1; /* [    5],        r/w,        0x0 */
            uint32_t tcr3_cnt_clr                   :  1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7_31                  : 25; /* [31: 7],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } TCER;

    /* 0x88 : Timer Counter Mode */
    union {
        struct {
            uint32_t reserved_0                     :  1; /* [    0],       rsvd,        0x0 */
            uint32_t timer2_mode                    :  1; /* [    1],        r/w,        0x0 */
            uint32_t timer3_mode                    :  1; /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_4                   :  2; /* [ 4: 3],       rsvd,        0x0 */
            uint32_t timer2_align                   :  1; /* [    5],        r/w,        0x0 */
            uint32_t timer3_align                   :  1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7_31                  : 25; /* [31: 7],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } TCMR;

    /* 0x8c  reserved */
    uint8_t RESERVED0x8c[4];

    /* 0x90 : Timer2 Match Interrupt Mode */
    union {
        struct {
            uint32_t tilr2_0                        :  1; /* [    0],        r/w,        0x0 */
            uint32_t tilr2_1                        :  1; /* [    1],        r/w,        0x0 */
            uint32_t tilr2_2                        :  1; /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_31                  : 29; /* [31: 3],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } TILR2;

