bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/timer_reg.h
    /* 0x94 : Timer3 Match Interrupt Mode */
    union {
        struct {
            uint32_t tilr3_0                        :  1; /* [    0],        r/w,        0x0 */
            uint32_t tilr3_1                        :  1; /* [    1],        r/w,        0x0 */
            uint32_t tilr3_2                        :  1; /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_31                  : 29; /* [31: 3],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } TILR3;

    /* 0x98 : WDT Counter Reset */
    union {
        struct {
            uint32_t wcr                            :  1; /* [    0],          w,        0x0 */
            uint32_t reserved_1_31                  : 31; /* [31: 1],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } WCR;

    /* 0x9C : WDT Access Key1 */
    union {
        struct {
            uint32_t wfar                           : 16; /* [15: 0],          w,        0x0 */
            uint32_t reserved_16_31                 : 16; /* [31:16],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } WFAR;

    /* 0xA0 : WDT Access Key2 */
    union {
        struct {
            uint32_t wsar                           : 16; /* [15: 0],          w,        0x0 */
            uint32_t reserved_16_31                 : 16; /* [31:16],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } WSAR;

    /* 0xa4  reserved */
    uint8_t RESERVED0xa4[4];

    /* 0xA8 : Timer2 Counter Latch Value */
    union {
        struct {
            uint32_t tcr2_cnt_lat                   : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } TCVWR2;

    /* 0xAC : Timer3 Counter Latch Value */
    union {
        struct {
            uint32_t tcr3_cnt_lat                   : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } TCVWR3;

    /* 0xb0  reserved */
    uint8_t RESERVED0xb0[4];

    /* 0xB4 : Timer2 Counter Sync Value */
    union {
        struct {
            uint32_t tcr2_cnt_sync                  : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } TCVSYN2;

    /* 0xB8 : Timer3 Counter Sync Value */
    union {
        struct {
            uint32_t tcr3_cnt_sync                  : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } TCVSYN3;

    /* 0xBC : Timer Division */
    union {
        struct {
            uint32_t reserved_0_7                   :  8; /* [ 7: 0],       rsvd,        0x0 */
            uint32_t tcdr2                          :  8; /* [15: 8],        r/w,        0x0 */
            uint32_t tcdr3                          :  8; /* [23:16],        r/w,        0x0 */
            uint32_t wcdr                           :  8; /* [31:24],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } TCDR;

    /* 0xC0 : GPIO Mode */
    union {
        struct {
            uint32_t reserved_0                     :  1; /* [    0],       rsvd,        0x0 */
            uint32_t timer2_gpio_en                 :  1; /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_4                   :  3; /* [ 4: 2],       rsvd,        0x0 */
            uint32_t timer2_gpio_inv                :  1; /* [    5],        r/w,        0x0 */
            uint32_t timer3_gpio_inv                :  1; /* [    6],        r/w,        0x0 */
            uint32_t wdt_gpio_inv                   :  1; /* [    7],        r/w,        0x0 */
            uint32_t reserved_8_30                  : 23; /* [30: 8],       rsvd,        0x0 */
            uint32_t gpio_lat_ok                    :  1; /* [   31],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } GPIO;

    /* 0xC4 : GPIO Latch Value1 */
    union {
        struct {
            uint32_t gpio_lat1                      : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } GPIO_LAT1;

    /* 0xC8 : GPIO Latch Value2 */
    union {
        struct {
            uint32_t gpio_lat2                      : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } GPIO_LAT2;

    /* 0xCC : Timer Division Force */
    union {
        struct {
            uint32_t reserved_0                     :  1; /* [    0],       rsvd,        0x0 */
            uint32_t tcdr2_force                    :  1; /* [    1],        r/w,        0x0 */
            uint32_t tcdr3_force                    :  1; /* [    2],        r/w,        0x0 */
            uint32_t reserved_3                     :  1; /* [    3],       rsvd,        0x0 */
            uint32_t wcdr_force                     :  1; /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_31                  : 27; /* [31: 5],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } TCDR_FORCE;

};

typedef volatile struct timer_reg timer_reg_t;


#endif  /* __TIMER_REG_H__ */
